; domain
(define (domain the_game)
    (:requirements :strips :typing :fluents :negative-preconditions :disjunctive-preconditions :conditional-effects)

    (:types 
        pile card - object
    )

    (:predicates
        (ascending_pile ?p - pile)
        (descending_pile ?p - pile)
        (card_in_hand ?c - card)
        (top_pile_card ?p - pile ?c - card)
        (next_card_in_deck ?c1 - card ?c2 - card)  ; Simulates list order in drawing pile
        (top_deck_card ?c - card)
        (is_drawing)
        (is_bottom_card ?c - card)
        (deck_empty)
    )

    (:functions
        (value ?c - card)
        (n_card_in_hand) 
    )

    (:action play_card
        :parameters (?c - card ?p - pile ?c_top - card)
        :precondition (and
            (card_in_hand ?c) 
            (top_pile_card ?p ?c_top) 
            (not (is_drawing))
            (or 
                (and (ascending_pile ?p) (> (value ?c) (value ?c_top)))
                (and (descending_pile ?p) (< (value ?c) (value ?c_top)))
                (and (ascending_pile ?p) (= (value ?c) (- (value ?c_top) 5)))
                (and (descending_pile ?p) (= (value ?c) (+ (value ?c_top) 5)))
            )
        )
        :effect (and
            (not (card_in_hand ?c))
            (top_pile_card ?p ?c)
            (not (top_pile_card ?p ?c_top))
            (decrease (n_card_in_hand) 1)

        )
    )

    (:action draw_card
        :parameters (?c1 - card ?c2 - card)
        :precondition (and
            (top_deck_card ?c1)
            (next_card_in_deck ?c1 ?c2)
            (<= (n_card_in_hand) 6)
            (or 
                (is_drawing)
                (<= (n_card_in_hand) 5)
            )
        )
        :effect (and
            (not (top_deck_card ?c1))
            (top_deck_card ?c2)
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (is_drawing)
        )
    )
    
    (:action stop_drawing
        :parameters ()
        :precondition (and 
            (= (n_card_in_hand) 7)
            (is_drawing)
        )
        :effect (not (is_drawing))
    )

    (:action draw_final_card
        :parameters (?c1 - card)
        :precondition (and
            (top_deck_card ?c1)
            (is_bottom_card ?c1)
        )
        :effect (and
            (not (top_deck_card ?c1))
            (card_in_hand ?c1)
            (increase (n_card_in_hand) 1)
            (not (is_drawing))
            (deck_empty)
        )
    )

)

; problem
(define (problem hard)
    (:domain the_game)
    (:objects
        pile0 pile1 pile2 pile3 - pile
        c_min c_max c7 c17 c14 c3 c22 c29 c18 c2 c26 c24 c20 c21 c27 c6 c13 c9 c12 c19 c5 c25 c28 c10 c8 c23 c16 c4 c15 c11 - card
    )
    (:init
        (ascending_pile pile0)
        (ascending_pile pile1)
        (descending_pile pile2)
        (descending_pile pile3)
        (top_pile_card pile0 c_min)
        (top_pile_card pile1 c_min)
        (top_pile_card pile2 c_max)
        (top_pile_card pile3 c_max)
        (top_deck_card c7)
        (next_card_in_deck c7 c17)
        (next_card_in_deck c17 c14)
        (next_card_in_deck c14 c3)
        (next_card_in_deck c3 c22)
        (next_card_in_deck c22 c29)
        (next_card_in_deck c29 c18)
        (next_card_in_deck c18 c2)
        (next_card_in_deck c2 c26)
        (next_card_in_deck c26 c24)
        (next_card_in_deck c24 c20)
        (next_card_in_deck c20 c21)
        (next_card_in_deck c21 c27)
        (next_card_in_deck c27 c6)
        (next_card_in_deck c6 c13)
        (next_card_in_deck c13 c9)
        (next_card_in_deck c9 c12)
        (next_card_in_deck c12 c19)
        (next_card_in_deck c19 c5)
        (next_card_in_deck c5 c25)
        (next_card_in_deck c25 c28)
        (next_card_in_deck c28 c10)
        (next_card_in_deck c10 c8)
        (next_card_in_deck c8 c23)
        (next_card_in_deck c23 c16)
        (next_card_in_deck c16 c4)
        (next_card_in_deck c4 c15)
        (next_card_in_deck c15 c11)
        (is_bottom_card c11)
        (= (n_card_in_hand) 0)
        (= (value c_min) 1)
        (= (value c_max) 30)
        (= (value c7) 7)
        (= (value c17) 17)
        (= (value c14) 14)
        (= (value c3) 3)
        (= (value c22) 22)
        (= (value c29) 29)
        (= (value c18) 18)
        (= (value c2) 2)
        (= (value c26) 26)
        (= (value c24) 24)
        (= (value c20) 20)
        (= (value c21) 21)
        (= (value c27) 27)
        (= (value c6) 6)
        (= (value c13) 13)
        (= (value c9) 9)
        (= (value c12) 12)
        (= (value c19) 19)
        (= (value c5) 5)
        (= (value c25) 25)
        (= (value c28) 28)
        (= (value c10) 10)
        (= (value c8) 8)
        (= (value c23) 23)
        (= (value c16) 16)
        (= (value c4) 4)
        (= (value c15) 15)
        (= (value c11) 11)
    )
    (:goal
        (and
            (deck_empty)
            (= (n_card_in_hand) 0)
        )
    )
)

; plan
1. (draw_card c7 c17)
   deleted: (top_deck_card c7)
   added: (top_deck_card c17) (card_in_hand c7) (is_drawing)
   changed: (n_card_in_hand) from 0 to 1
   goals met: 0 of 2
2. (draw_card c17 c14)
   deleted: (top_deck_card c17)
   added: (top_deck_card c14) (card_in_hand c17)
   changed: (n_card_in_hand) from 1 to 2
   goals met: 0 of 2
3. (draw_card c14 c3)
   deleted: (top_deck_card c14)
   added: (top_deck_card c3) (card_in_hand c14)
   changed: (n_card_in_hand) from 2 to 3
   goals met: 0 of 2
4. (draw_card c3 c22)
   deleted: (top_deck_card c3)
   added: (top_deck_card c22) (card_in_hand c3)
   changed: (n_card_in_hand) from 3 to 4
   goals met: 0 of 2
5. (draw_card c22 c29)
   deleted: (top_deck_card c22)
   added: (top_deck_card c29) (card_in_hand c22)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
6. (draw_card c29 c18)
   deleted: (top_deck_card c29)
   added: (top_deck_card c18) (card_in_hand c29)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
7. (draw_card c18 c2)
   deleted: (top_deck_card c18)
   added: (top_deck_card c2) (card_in_hand c18)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
8. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
9. (play_card c7 pile3 c_max)
   deleted: (card_in_hand c7) (top_pile_card pile3 c_max)
   added: (top_pile_card pile3 c7)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
10. (play_card c18 pile2 c_max)
   deleted: (card_in_hand c18) (top_pile_card pile2 c_max)
   added: (top_pile_card pile2 c18)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
11. (play_card c17 pile2 c18)
   deleted: (card_in_hand c17) (top_pile_card pile2 c18)
   added: (top_pile_card pile2 c17)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 0 of 2
12. (draw_card c2 c26)
   deleted: (top_deck_card c2)
   added: (top_deck_card c26) (card_in_hand c2) (is_drawing)
   changed: (n_card_in_hand) from 4 to 5
   goals met: 0 of 2
13. (draw_card c26 c24)
   deleted: (top_deck_card c26)
   added: (top_deck_card c24) (card_in_hand c26)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
14. (draw_card c24 c20)
   deleted: (top_deck_card c24)
   added: (top_deck_card c20) (card_in_hand c24)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
15. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
16. (play_card c24 pile0 c_min)
   deleted: (card_in_hand c24) (top_pile_card pile0 c_min)
   added: (top_pile_card pile0 c24)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
17. (play_card c26 pile0 c24)
   deleted: (card_in_hand c26) (top_pile_card pile0 c24)
   added: (top_pile_card pile0 c26)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
18. (draw_card c20 c21)
   deleted: (top_deck_card c20)
   added: (top_deck_card c21) (card_in_hand c20) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
19. (draw_card c21 c27)
   deleted: (top_deck_card c21)
   added: (top_deck_card c27) (card_in_hand c21)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
20. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
21. (play_card c21 pile1 c_min)
   deleted: (card_in_hand c21) (top_pile_card pile1 c_min)
   added: (top_pile_card pile1 c21)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
22. (play_card c29 pile1 c21)
   deleted: (card_in_hand c29) (top_pile_card pile1 c21)
   added: (top_pile_card pile1 c29)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
23. (draw_card c27 c6)
   deleted: (top_deck_card c27)
   added: (top_deck_card c6) (card_in_hand c27) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
24. (draw_card c6 c13)
   deleted: (top_deck_card c6)
   added: (top_deck_card c13) (card_in_hand c6)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
25. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
26. (play_card c6 pile2 c17)
   deleted: (card_in_hand c6) (top_pile_card pile2 c17)
   added: (top_pile_card pile2 c6)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
27. (play_card c2 pile2 c6)
   deleted: (card_in_hand c2) (top_pile_card pile2 c6)
   added: (top_pile_card pile2 c2)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
28. (draw_card c13 c9)
   deleted: (top_deck_card c13)
   added: (top_deck_card c9) (card_in_hand c13) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
29. (draw_card c9 c12)
   deleted: (top_deck_card c9)
   added: (top_deck_card c12) (card_in_hand c9)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
30. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
31. (play_card c27 pile0 c26)
   deleted: (card_in_hand c27) (top_pile_card pile0 c26)
   added: (top_pile_card pile0 c27)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
32. (play_card c22 pile0 c27)
   deleted: (card_in_hand c22) (top_pile_card pile0 c27)
   added: (top_pile_card pile0 c22)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
33. (draw_card c12 c19)
   deleted: (top_deck_card c12)
   added: (top_deck_card c19) (card_in_hand c12) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
34. (draw_card c19 c5)
   deleted: (top_deck_card c19)
   added: (top_deck_card c5) (card_in_hand c19)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
35. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
36. (play_card c12 pile3 c7)
   deleted: (card_in_hand c12) (top_pile_card pile3 c7)
   added: (top_pile_card pile3 c12)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
37. (play_card c9 pile3 c12)
   deleted: (card_in_hand c9) (top_pile_card pile3 c12)
   added: (top_pile_card pile3 c9)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
38. (draw_card c5 c25)
   deleted: (top_deck_card c5)
   added: (top_deck_card c25) (card_in_hand c5) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
39. (draw_card c25 c28)
   deleted: (top_deck_card c25)
   added: (top_deck_card c28) (card_in_hand c25)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
40. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
41. (play_card c25 pile0 c22)
   deleted: (card_in_hand c25) (top_pile_card pile0 c22)
   added: (top_pile_card pile0 c25)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
42. (play_card c20 pile0 c25)
   deleted: (card_in_hand c20) (top_pile_card pile0 c25)
   added: (top_pile_card pile0 c20)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
43. (draw_card c28 c10)
   deleted: (top_deck_card c28)
   added: (top_deck_card c10) (card_in_hand c28) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
44. (draw_card c10 c8)
   deleted: (top_deck_card c10)
   added: (top_deck_card c8) (card_in_hand c10)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
45. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
46. (play_card c28 pile0 c20)
   deleted: (card_in_hand c28) (top_pile_card pile0 c20)
   added: (top_pile_card pile0 c28)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
47. (play_card c5 pile3 c9)
   deleted: (card_in_hand c5) (top_pile_card pile3 c9)
   added: (top_pile_card pile3 c5)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
48. (draw_card c8 c23)
   deleted: (top_deck_card c8)
   added: (top_deck_card c23) (card_in_hand c8) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
49. (draw_card c23 c16)
   deleted: (top_deck_card c23)
   added: (top_deck_card c16) (card_in_hand c23)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
50. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
51. (play_card c23 pile0 c28)
   deleted: (card_in_hand c23) (top_pile_card pile0 c28)
   added: (top_pile_card pile0 c23)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
52. (play_card c10 pile3 c5)
   deleted: (card_in_hand c10) (top_pile_card pile3 c5)
   added: (top_pile_card pile3 c10)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
53. (draw_card c16 c4)
   deleted: (top_deck_card c16)
   added: (top_deck_card c4) (card_in_hand c16) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
54. (draw_card c4 c15)
   deleted: (top_deck_card c4)
   added: (top_deck_card c15) (card_in_hand c4)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 0 of 2
55. (stop_drawing)
   deleted: (is_drawing)
   goals met: 0 of 2
56. (play_card c4 pile3 c10)
   deleted: (card_in_hand c4) (top_pile_card pile3 c10)
   added: (top_pile_card pile3 c4)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 0 of 2
57. (play_card c3 pile3 c4)
   deleted: (card_in_hand c3) (top_pile_card pile3 c4)
   added: (top_pile_card pile3 c3)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 0 of 2
58. (draw_card c15 c11)
   deleted: (top_deck_card c15)
   added: (top_deck_card c11) (card_in_hand c15) (is_drawing)
   changed: (n_card_in_hand) from 5 to 6
   goals met: 0 of 2
59. (draw_final_card c11)
   deleted: (top_deck_card c11) (is_drawing)
   added: (card_in_hand c11) (deck_empty)
   changed: (n_card_in_hand) from 6 to 7
   goals met: 1 of 2
60. (play_card c8 pile3 c3)
   deleted: (card_in_hand c8) (top_pile_card pile3 c3)
   added: (top_pile_card pile3 c8)
   changed: (n_card_in_hand) from 7 to 6
   goals met: 1 of 2
61. (play_card c13 pile3 c8)
   deleted: (card_in_hand c13) (top_pile_card pile3 c8)
   added: (top_pile_card pile3 c13)
   changed: (n_card_in_hand) from 6 to 5
   goals met: 1 of 2
62. (play_card c11 pile3 c13)
   deleted: (card_in_hand c11) (top_pile_card pile3 c13)
   added: (top_pile_card pile3 c11)
   changed: (n_card_in_hand) from 5 to 4
   goals met: 1 of 2
63. (play_card c16 pile3 c11)
   deleted: (card_in_hand c16) (top_pile_card pile3 c11)
   added: (top_pile_card pile3 c16)
   changed: (n_card_in_hand) from 4 to 3
   goals met: 1 of 2
64. (play_card c15 pile3 c16)
   deleted: (card_in_hand c15) (top_pile_card pile3 c16)
   added: (top_pile_card pile3 c15)
   changed: (n_card_in_hand) from 3 to 2
   goals met: 1 of 2
65. (play_card c14 pile3 c15)
   deleted: (card_in_hand c14) (top_pile_card pile3 c15)
   added: (top_pile_card pile3 c14)
   changed: (n_card_in_hand) from 2 to 1
   goals met: 1 of 2
66. (play_card c19 pile3 c14)
   deleted: (card_in_hand c19) (top_pile_card pile3 c14)
   added: (top_pile_card pile3 c19)
   changed: (n_card_in_hand) from 1 to 0
   goals met: 2 of 2
